espressif/esp-idf/components/soc/esp32c5/register/soc/apb_saradc_reg.h
/** APB_SARADC_FILTER_CTRL0_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_FILTER_CTRL0_REG (DR_REG_APB_SARADC_BASE + 0x28)
/** APB_SARADC_APB_SARADC_FILTER_CHANNEL1 : R/W; bitpos: [21:18]; default: 13;
 *  configure filter1 to adc channel
 */
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL1    0x0000000FU
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL1_M  (APB_SARADC_APB_SARADC_FILTER_CHANNEL1_V << APB_SARADC_APB_SARADC_FILTER_CHANNEL1_S)
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL1_V  0x0000000FU
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL1_S  18
/** APB_SARADC_APB_SARADC_FILTER_CHANNEL0 : R/W; bitpos: [25:22]; default: 13;
 *  configure filter0 to adc channel
 */
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL0    0x0000000FU
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL0_M  (APB_SARADC_APB_SARADC_FILTER_CHANNEL0_V << APB_SARADC_APB_SARADC_FILTER_CHANNEL0_S)
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL0_V  0x0000000FU
#define APB_SARADC_APB_SARADC_FILTER_CHANNEL0_S  22
/** APB_SARADC_APB_SARADC_FILTER_RESET : R/W; bitpos: [31]; default: 0;
 *  enable apb_adc1_filter
 */
#define APB_SARADC_APB_SARADC_FILTER_RESET    (BIT(31))
#define APB_SARADC_APB_SARADC_FILTER_RESET_M  (APB_SARADC_APB_SARADC_FILTER_RESET_V << APB_SARADC_APB_SARADC_FILTER_RESET_S)
#define APB_SARADC_APB_SARADC_FILTER_RESET_V  0x00000001U
#define APB_SARADC_APB_SARADC_FILTER_RESET_S  31

/** APB_SARADC_SAR1DATA_STATUS_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_SAR1DATA_STATUS_REG (DR_REG_APB_SARADC_BASE + 0x2c)
/** APB_SARADC_APB_SARADC1_DATA : RO; bitpos: [16:0]; default: 0;
 *  saradc1 data
 */
#define APB_SARADC_APB_SARADC1_DATA    0x0001FFFFU
#define APB_SARADC_APB_SARADC1_DATA_M  (APB_SARADC_APB_SARADC1_DATA_V << APB_SARADC_APB_SARADC1_DATA_S)
#define APB_SARADC_APB_SARADC1_DATA_V  0x0001FFFFU
#define APB_SARADC_APB_SARADC1_DATA_S  0

/** APB_SARADC_SAR2DATA_STATUS_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_SAR2DATA_STATUS_REG (DR_REG_APB_SARADC_BASE + 0x30)
/** APB_SARADC_APB_SARADC2_DATA : RO; bitpos: [16:0]; default: 0;
 *  saradc2 data
 */
#define APB_SARADC_APB_SARADC2_DATA    0x0001FFFFU
#define APB_SARADC_APB_SARADC2_DATA_M  (APB_SARADC_APB_SARADC2_DATA_V << APB_SARADC_APB_SARADC2_DATA_S)
#define APB_SARADC_APB_SARADC2_DATA_V  0x0001FFFFU
#define APB_SARADC_APB_SARADC2_DATA_S  0

/** APB_SARADC_THRES0_CTRL_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_THRES0_CTRL_REG (DR_REG_APB_SARADC_BASE + 0x34)
/** APB_SARADC_APB_SARADC_THRES0_CHANNEL : R/W; bitpos: [3:0]; default: 13;
 *  configure thres0 to adc channel
 */
#define APB_SARADC_APB_SARADC_THRES0_CHANNEL    0x0000000FU
#define APB_SARADC_APB_SARADC_THRES0_CHANNEL_M  (APB_SARADC_APB_SARADC_THRES0_CHANNEL_V << APB_SARADC_APB_SARADC_THRES0_CHANNEL_S)
#define APB_SARADC_APB_SARADC_THRES0_CHANNEL_V  0x0000000FU
#define APB_SARADC_APB_SARADC_THRES0_CHANNEL_S  0
/** APB_SARADC_APB_SARADC_THRES0_HIGH : R/W; bitpos: [17:5]; default: 8191;
 *  saradc thres0 monitor thres
 */
#define APB_SARADC_APB_SARADC_THRES0_HIGH    0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES0_HIGH_M  (APB_SARADC_APB_SARADC_THRES0_HIGH_V << APB_SARADC_APB_SARADC_THRES0_HIGH_S)
#define APB_SARADC_APB_SARADC_THRES0_HIGH_V  0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES0_HIGH_S  5
/** APB_SARADC_APB_SARADC_THRES0_LOW : R/W; bitpos: [30:18]; default: 0;
 *  saradc thres0 monitor thres
 */
#define APB_SARADC_APB_SARADC_THRES0_LOW    0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES0_LOW_M  (APB_SARADC_APB_SARADC_THRES0_LOW_V << APB_SARADC_APB_SARADC_THRES0_LOW_S)
#define APB_SARADC_APB_SARADC_THRES0_LOW_V  0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES0_LOW_S  18

/** APB_SARADC_THRES1_CTRL_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_THRES1_CTRL_REG (DR_REG_APB_SARADC_BASE + 0x38)
/** APB_SARADC_APB_SARADC_THRES1_CHANNEL : R/W; bitpos: [3:0]; default: 13;
 *  configure thres1 to adc channel
 */
#define APB_SARADC_APB_SARADC_THRES1_CHANNEL    0x0000000FU
#define APB_SARADC_APB_SARADC_THRES1_CHANNEL_M  (APB_SARADC_APB_SARADC_THRES1_CHANNEL_V << APB_SARADC_APB_SARADC_THRES1_CHANNEL_S)
#define APB_SARADC_APB_SARADC_THRES1_CHANNEL_V  0x0000000FU
#define APB_SARADC_APB_SARADC_THRES1_CHANNEL_S  0
/** APB_SARADC_APB_SARADC_THRES1_HIGH : R/W; bitpos: [17:5]; default: 8191;
 *  saradc thres1 monitor thres
 */
#define APB_SARADC_APB_SARADC_THRES1_HIGH    0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES1_HIGH_M  (APB_SARADC_APB_SARADC_THRES1_HIGH_V << APB_SARADC_APB_SARADC_THRES1_HIGH_S)
#define APB_SARADC_APB_SARADC_THRES1_HIGH_V  0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES1_HIGH_S  5
/** APB_SARADC_APB_SARADC_THRES1_LOW : R/W; bitpos: [30:18]; default: 0;
 *  saradc thres1 monitor thres
 */
#define APB_SARADC_APB_SARADC_THRES1_LOW    0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES1_LOW_M  (APB_SARADC_APB_SARADC_THRES1_LOW_V << APB_SARADC_APB_SARADC_THRES1_LOW_S)
#define APB_SARADC_APB_SARADC_THRES1_LOW_V  0x00001FFFU
#define APB_SARADC_APB_SARADC_THRES1_LOW_S  18

/** APB_SARADC_THRES_CTRL_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_THRES_CTRL_REG (DR_REG_APB_SARADC_BASE + 0x3c)
/** APB_SARADC_APB_SARADC_THRES_ALL_EN : R/W; bitpos: [27]; default: 0;
 *  enable thres to all channel
 */
#define APB_SARADC_APB_SARADC_THRES_ALL_EN    (BIT(27))
#define APB_SARADC_APB_SARADC_THRES_ALL_EN_M  (APB_SARADC_APB_SARADC_THRES_ALL_EN_V << APB_SARADC_APB_SARADC_THRES_ALL_EN_S)
#define APB_SARADC_APB_SARADC_THRES_ALL_EN_V  0x00000001U
#define APB_SARADC_APB_SARADC_THRES_ALL_EN_S  27
/** APB_SARADC_APB_SARADC_THRES1_EN : R/W; bitpos: [30]; default: 0;
 *  enable thres1
 */
#define APB_SARADC_APB_SARADC_THRES1_EN    (BIT(30))
#define APB_SARADC_APB_SARADC_THRES1_EN_M  (APB_SARADC_APB_SARADC_THRES1_EN_V << APB_SARADC_APB_SARADC_THRES1_EN_S)
#define APB_SARADC_APB_SARADC_THRES1_EN_V  0x00000001U
#define APB_SARADC_APB_SARADC_THRES1_EN_S  30
/** APB_SARADC_APB_SARADC_THRES0_EN : R/W; bitpos: [31]; default: 0;
 *  enable thres0
 */
#define APB_SARADC_APB_SARADC_THRES0_EN    (BIT(31))
#define APB_SARADC_APB_SARADC_THRES0_EN_M  (APB_SARADC_APB_SARADC_THRES0_EN_V << APB_SARADC_APB_SARADC_THRES0_EN_S)
#define APB_SARADC_APB_SARADC_THRES0_EN_V  0x00000001U
#define APB_SARADC_APB_SARADC_THRES0_EN_S  31

